In [1]:
# We have imported numpy and pandas libraries.
# We have imported linear_model library which is used for linear regression

In [2]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [3]:
#We are conduct csv file and then showing there in output

In [5]:
data=pd.read_csv("Desktop/hiring.csv")
data

   experience  test_score  interview_score  salary
0         NaN         8.0                9   50000
1         NaN         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [6]:
# We are removing all the null values from our table.

In [7]:
data.experience = data.experience.fillna(data.experience.median())
data

   experience  test_score  interview_score  salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [8]:
data.test_score= data.test_score.fillna(data.test_score.median())
data

   experience  test_score  interview_score  salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         8.0                7   72000
7        11.0         7.0                8   80000

In [9]:
# We are training our model in LinearRegression
# we have 3 independent variables experience, test_score and interview_score and 1 dependent variable salary.

In [10]:
MyTable = linear_model.LinearRegression()
MyTable.fit(data[["experience","test_score","interview_score"]],data.salary)

LinearRegression()

In [11]:
# We are conduct the value of coefficient of our independent variable

In [12]:
MyTable.coef_

array([2813.00813008, 1333.33333333, 2926.82926829])

In [13]:
# We are conduct the value of our intercept

In [14]:
MyTable.intercept_

11869.918699186957

In [15]:
# We are predicting the value of dependent variable(salary) using independent variables

In [16]:
MyTable.predict([[7,9,6]])

array([61121.95121951])

In [17]:
# here the predicted value using the calculation of equation mx+c

In [18]:
2813.00813008*7 + 1333.33333333*9 + 2926.82926829*6 + 11869.91869918695

61121.95121945695

In [19]:
# Now we are finding the mean_squared_error [difference between original salary and predicted salary]

In [20]:
from sklearn.metrics import mean_squared_error
mean_squared_error([70000],[61121.95121951],squared = False)

8878.048780489997